MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX695F512L.atdf
         <register caption="" name="TRISC" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISC" />
            <bitfield mask="0x00000002" name="TRISC" />
            <bitfield mask="0x00000004" name="TRISC" />
            <bitfield mask="0x00000008" name="TRISC" />
            <bitfield mask="0x00000010" name="TRISC" />
            <bitfield mask="0x00000020" name="TRISC" />
            <bitfield mask="0x00000040" name="TRISC" />
            <bitfield mask="0x00000080" name="TRISC" />
            <bitfield mask="0x00000100" name="TRISC" />
            <bitfield mask="0x00000200" name="TRISC" />
            <bitfield mask="0x00000400" name="TRISC" />
            <bitfield mask="0x00000800" name="TRISC" />
            <bitfield mask="0x00001000" name="TRISC" />
            <bitfield mask="0x00002000" name="TRISC" />
            <bitfield mask="0x00004000" name="TRISC" />
            <bitfield mask="0x00008000" name="TRISC" />
         </register>
         <register caption="" name="TRISD" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISD" />
            <bitfield mask="0x00000002" name="TRISD" />
            <bitfield mask="0x00000004" name="TRISD" />
            <bitfield mask="0x00000008" name="TRISD" />
            <bitfield mask="0x00000010" name="TRISD" />
            <bitfield mask="0x00000020" name="TRISD" />
            <bitfield mask="0x00000040" name="TRISD" />
            <bitfield mask="0x00000080" name="TRISD" />
            <bitfield mask="0x00000100" name="TRISD" />
            <bitfield mask="0x00000200" name="TRISD" />
            <bitfield mask="0x00000400" name="TRISD" />
            <bitfield mask="0x00000800" name="TRISD" />
            <bitfield mask="0x00001000" name="TRISD" />
            <bitfield mask="0x00002000" name="TRISD" />
            <bitfield mask="0x00004000" name="TRISD" />
            <bitfield mask="0x00008000" name="TRISD" />
         </register>
         <register caption="" name="TRISE" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISE" />
            <bitfield mask="0x00000002" name="TRISE" />
            <bitfield mask="0x00000004" name="TRISE" />
            <bitfield mask="0x00000008" name="TRISE" />
            <bitfield mask="0x00000010" name="TRISE" />
            <bitfield mask="0x00000020" name="TRISE" />
            <bitfield mask="0x00000040" name="TRISE" />
            <bitfield mask="0x00000080" name="TRISE" />
            <bitfield mask="0x00000100" name="TRISE" />
            <bitfield mask="0x00000200" name="TRISE" />
            <bitfield mask="0x00000400" name="TRISE" />
            <bitfield mask="0x00000800" name="TRISE" />
            <bitfield mask="0x00001000" name="TRISE" />
            <bitfield mask="0x00002000" name="TRISE" />
            <bitfield mask="0x00004000" name="TRISE" />
            <bitfield mask="0x00008000" name="TRISE" />
         </register>
         <register caption="" name="TRISF" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISF" />
            <bitfield mask="0x00000002" name="TRISF" />
            <bitfield mask="0x00000004" name="TRISF" />
            <bitfield mask="0x00000008" name="TRISF" />
            <bitfield mask="0x00000010" name="TRISF" />
            <bitfield mask="0x00000020" name="TRISF" />
            <bitfield mask="0x00000040" name="TRISF" />
            <bitfield mask="0x00000080" name="TRISF" />
            <bitfield mask="0x00000100" name="TRISF" />
            <bitfield mask="0x00000200" name="TRISF" />
            <bitfield mask="0x00000400" name="TRISF" />
            <bitfield mask="0x00000800" name="TRISF" />
            <bitfield mask="0x00001000" name="TRISF" />
            <bitfield mask="0x00002000" name="TRISF" />
            <bitfield mask="0x00004000" name="TRISF" />
            <bitfield mask="0x00008000" name="TRISF" />
         </register>
         <register caption="" name="PORTA" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTA" />
            <bitfield mask="0x00000002" name="PORTA" />
            <bitfield mask="0x00000004" name="PORTA" />
            <bitfield mask="0x00000008" name="PORTA" />
            <bitfield mask="0x00000010" name="PORTA" />
            <bitfield mask="0x00000020" name="PORTA" />
            <bitfield mask="0x00000040" name="PORTA" />
            <bitfield mask="0x00000080" name="PORTA" />
            <bitfield mask="0x00000100" name="PORTA" />
            <bitfield mask="0x00000200" name="PORTA" />
            <bitfield mask="0x00000400" name="PORTA" />
            <bitfield mask="0x00000800" name="PORTA" />
            <bitfield mask="0x00001000" name="PORTA" />
            <bitfield mask="0x00002000" name="PORTA" />
            <bitfield mask="0x00004000" name="PORTA" />
            <bitfield mask="0x00008000" name="PORTA" />
         </register>
         <register caption="" name="PORTB" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTB" />
            <bitfield mask="0x00000002" name="PORTB" />
            <bitfield mask="0x00000004" name="PORTB" />
            <bitfield mask="0x00000008" name="PORTB" />
            <bitfield mask="0x00000010" name="PORTB" />
            <bitfield mask="0x00000020" name="PORTB" />
            <bitfield mask="0x00000040" name="PORTB" />
            <bitfield mask="0x00000080" name="PORTB" />
            <bitfield mask="0x00000100" name="PORTB" />
            <bitfield mask="0x00000200" name="PORTB" />
            <bitfield mask="0x00000400" name="PORTB" />
            <bitfield mask="0x00000800" name="PORTB" />
            <bitfield mask="0x00001000" name="PORTB" />
            <bitfield mask="0x00002000" name="PORTB" />
            <bitfield mask="0x00004000" name="PORTB" />
            <bitfield mask="0x00008000" name="PORTB" />
         </register>
         <register caption="" name="PORTC" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTC" />
            <bitfield mask="0x00000002" name="PORTC" />
            <bitfield mask="0x00000004" name="PORTC" />
            <bitfield mask="0x00000008" name="PORTC" />
            <bitfield mask="0x00000010" name="PORTC" />
            <bitfield mask="0x00000020" name="PORTC" />
            <bitfield mask="0x00000040" name="PORTC" />
            <bitfield mask="0x00000080" name="PORTC" />
            <bitfield mask="0x00000100" name="PORTC" />
            <bitfield mask="0x00000200" name="PORTC" />
            <bitfield mask="0x00000400" name="PORTC" />
            <bitfield mask="0x00000800" name="PORTC" />
            <bitfield mask="0x00001000" name="PORTC" />
            <bitfield mask="0x00002000" name="PORTC" />
            <bitfield mask="0x00004000" name="PORTC" />
            <bitfield mask="0x00008000" name="PORTC" />
         </register>
         <register caption="" name="PORTD" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTD" />
            <bitfield mask="0x00000002" name="PORTD" />
            <bitfield mask="0x00000004" name="PORTD" />
            <bitfield mask="0x00000008" name="PORTD" />
            <bitfield mask="0x00000010" name="PORTD" />
            <bitfield mask="0x00000020" name="PORTD" />
            <bitfield mask="0x00000040" name="PORTD" />
            <bitfield mask="0x00000080" name="PORTD" />
            <bitfield mask="0x00000100" name="PORTD" />
            <bitfield mask="0x00000200" name="PORTD" />
            <bitfield mask="0x00000400" name="PORTD" />
            <bitfield mask="0x00000800" name="PORTD" />
            <bitfield mask="0x00001000" name="PORTD" />
            <bitfield mask="0x00002000" name="PORTD" />
            <bitfield mask="0x00004000" name="PORTD" />
            <bitfield mask="0x00008000" name="PORTD" />
         </register>
         <register caption="" name="PORTE" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTE" />
            <bitfield mask="0x00000002" name="PORTE" />
            <bitfield mask="0x00000004" name="PORTE" />
            <bitfield mask="0x00000008" name="PORTE" />
            <bitfield mask="0x00000010" name="PORTE" />
            <bitfield mask="0x00000020" name="PORTE" />
            <bitfield mask="0x00000040" name="PORTE" />
            <bitfield mask="0x00000080" name="PORTE" />
            <bitfield mask="0x00000100" name="PORTE" />
            <bitfield mask="0x00000200" name="PORTE" />
            <bitfield mask="0x00000400" name="PORTE" />
            <bitfield mask="0x00000800" name="PORTE" />
            <bitfield mask="0x00001000" name="PORTE" />
            <bitfield mask="0x00002000" name="PORTE" />
            <bitfield mask="0x00004000" name="PORTE" />
            <bitfield mask="0x00008000" name="PORTE" />
         </register>
